Revit 2024 API
FailureDefinition Properties
The FailureDefinition type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Severity
 The severity of the failure.
See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace